# Pandas

Pandas is an easy-to-use, fast, flexible, and powerful open-source Python library for working with “relational” or “labeled” data. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python by offering data structures and operations for manipulating tables. And, like Numpy, a Pandas implementation is faster than a default Python ones, and it is a third-party module, which means it is not part of Python's suite of built-in libraries. 

Pandas is a very big topic and it has so many features that cannot be tacked in this module. You can do further studying by reading the official documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html.

**Import**

Again, we have to import the library first, similar to numpy.

In [1]:
import numpy as np
import pandas as pd

The alias `pd` is a common namin convention for pandas.

Note that Jupyter has the following features: tab-completion(<TAB>) and `?`. You may use this to explore and access the documentation for anything that you are looking for.

```
Example:

ipython
In [1]: pd.<TAB>
or

ipython
In [2]: pd.__version__?
```

**Data Strucures**

Pandas has 2 data structures: `Series` and `Dataframe`. These 2 give us many features that make it easy to do data analysis.

## 1. Series

Pandas Series is a one-dimensional array-like object that has index and value just like NumPy and is capable of holding any data type. 

**Creating Series**

You can input a list, numpy array, and dictionary to create a Series. Here are some examples of showcasing those.

In [2]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a   -0.528704
b    0.517890
c   -1.201350
d   -1.080025
e    2.044870
dtype: float64

In [3]:
print(type(s))
print(s.name)

<class 'pandas.core.series.Series'>
None

You can access the values by indexing.

In [4]:
s['a']

-0.5287041215347653

If you don't pass an argument for index, it uses 0..n by default.

In [5]:
s = pd.Series([8,7,6,5], name='test_data')
print('Name: ',s.name)
print('Data:\n',s)
print('Type of Object: ',type(s))
print('Type of elements:',type(s.values))

Name:  test_data
Data:
 0    8
1    7
2    6
3    5
Name: test_data, dtype: int64
Type of Object:  <class 'pandas.core.series.Series'>
Type of elements: <class 'numpy.ndarray'>

We can also create a Series from a dictionary.

In [6]:
libs_dict = {'Library1': 'Numpy', 
               'Library2': 'Pandas', 
               'Library3': 'Matplotlib'}
s = pd.Series(libs_dict)
print(s)
print(type(s))

Library1         Numpy
Library2        Pandas
Library3    Matplotlib
dtype: object
<class 'pandas.core.series.Series'>

In [7]:
s['Library2']

'Pandas'

As you can see, when creating a Pandas Series, only the data (first argument) is mandatory here. The rest are optional; you can opt not to input the name or index.

**Editing Series**

Editing a Series is very similar to how you do it with `dict`s.

In [8]:
libs_dict = {'Library1': 'Numpy', 'Library2': 'Pandas', 'Library3': 'Matplotlib'}
s = pd.Series(libs_dict)
print(s)

s['Library2'] = 'Pandas 2.0'
s['Library4'] = 'GeoPandas'
print(s)

s.pop('Library4')
print(s)

Library1         Numpy
Library2        Pandas
Library3    Matplotlib
dtype: object
Library1         Numpy
Library2    Pandas 2.0
Library3    Matplotlib
Library4     GeoPandas
dtype: object
Library1         Numpy
Library2    Pandas 2.0
Library3    Matplotlib
dtype: object

## 2. Dataframe

Dataframe is like spreadsheet or a SQL table. It is basically a 2-dimensional labelled data structure with columns of potentially different data types. To put it simply, `DataFrame` is a multi-column `Series` object. It is generally the most commonly used pandas object, and like `Series`, `DataFrame` accepts many different kinds of input:

 - Dict of 1D ndarrays, lists, dicts, or Series
 - 2-D numpy.ndarray
 - Structured or record ndarray
 - A `Series`
 - Another `DataFrame`
  
Here are some examples of creating Dataframes using different data types and structures as inputs.

**Creating Dataframe using dict**

In [9]:
data = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(data)
print('Dataframe:\n',df)
print('Type of Object:',type(df))
print('Type of elements:',type(df.values))

Dataframe:
    one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
Type of Object: <class 'pandas.core.frame.DataFrame'>
Type of elements: <class 'numpy.ndarray'>

Just like Series, you can access index, values and also columns.

In [10]:
print('Index: ',df.index)
print('Columns: ',df.columns)
print('Values of Column one: ',df['one'].values)
print('Values of Column two: ',df['two'].values)

Index:  Index(['a', 'b', 'c', 'd'], dtype='object')
Columns:  Index(['one', 'two'], dtype='object')
Values of Column one:  [ 1.  2.  3. nan]
Values of Column two:  [1. 2. 3. 4.]

**Creating Dataframe using list of dict**

In [11]:
df2 = pd.DataFrame([{'a': 1, 'b': 2, 'c':3, 'd':None}, 
                    {'a': 2, 'b': 2, 'c': 3, 'd': 4}],
                   index=['one', 'two'])
print('Dataframe: \n',df2)

# Ofcourse you can also transpose the result:
print('Transposed Dataframe: \n',df2.T)

Dataframe:
      a  b  c    d
one  1  2  3  NaN
two  2  2  3  4.0
Transposed Dataframe:
    one  two
a  1.0  2.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

**Editing DataFrame**

Assigning a column that doesn’t exist will create a new column.

In [12]:
df = pd.DataFrame(data)

df['three'] = None
print('Added third column: \n',df)

# The del keyword can be used delete columns:
del df['three']
print('\nDeleted third column: \n',df)
# You can also use df.drop(). We shall see that later

df.loc['a','one'] = 9000
print('\nEdited a value: \n',df)

Added third column:
    one  two three
a  1.0  1.0  None
b  2.0  2.0  None
c  3.0  3.0  None
d  NaN  4.0  None

Deleted third column:
    one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

Edited a value:
       one  two
a  9000.0  1.0
b     2.0  2.0
c     3.0  3.0
d     NaN  4.0

### 2.1 Reindexing

In Pandas, we can do reindexing, which means to create a new object with the data conformed to a new index.

In [13]:
data = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [14]:
# Reindex in descending order.
df.reindex(['d','c','b','a'])

   one  two
d  NaN  4.0
c  3.0  3.0
b  2.0  2.0
a  1.0  1.0

If you reindex with more number of rows than in the dataframe, it will return the dataframe with new row whose values are `NaN`.

In [15]:
df.reindex(['a','b','c','d','e'])

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
e  NaN  NaN

Reindexing is also useful when you want to introduce any missing values. For example in our case, look at column `one` and row `d`.

In [16]:
df.reindex(['a','b','c','d','e'], fill_value=0)
# Guess why the df['one']['d'] was not filled with 0 ?

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
e  0.0  0.0

### 2.2 Dropping entries

We can drop the rows/entries by using the `drop` function.

In [17]:
data = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [18]:
df.drop(['c', 'a'])

   one  two
b  2.0  2.0
d  NaN  4.0

### 2.3 Indexing, Filtering, and Sorting 

**Indexing**

Series indexing works similarly to NumPy array indexing, except you can use the Series’s index values instead of only integers.

To slice and select only column one for rows 0 and 4 use the following.

In [19]:
print("Dataframe: \n",df)
# Slicing and selecting only column `one` for row 0 and row 4
df['one'][['a', 'd']]

Dataframe:
    one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

a    1.0
d    NaN
Name: one, dtype: float64

In [20]:
# Slicing df from row b to row 4 for column `one`
df['one']['b':'d']

b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In the above cell, you will notice that slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive.

For DataFrame label-indexing on the rows, there is a special indexing field loc, which enables us to select a subset of the rows and columns from a `DataFrame` with `numpy`-like notation plus axis labels. It is a less verbose way to do the reindexing, but we typically use this.

In [21]:
df.loc[['a','c'],['one']]

   one
a  1.0
c  3.0

**Filtering**

We can also filter by having a condition inside `loc`.

In [22]:
df.loc[df.one > 1]

   one  two
b  2.0  2.0
c  3.0  3.0

There are many ways to select and rearrange the data contained in a pandas object. Some indexing options can be seen in below table:

|Indexing Type| Description|
|:---|:---|
|df[val] | Select single column or sequence of columns from the DataFrame. Special case con- veniences: boolean array (filter rows), slice (slice rows), or boolean DataFrame (set values based on some criterion).|
|df.ix[val] | Selects single row of subset of rows from the DataFrame.|
|df.ix[:, val] | Selects single column of subset of columns.|
|df.ix[val1, val2] | Select both rows and columns.|
|reindex method | Conform one or more axes to new indexes.|
|xs method | Select single row or column as a Series by label.|
|icol, irowmethods | Select single column or row, respectively, as a Series by integer location.|
|get_value, set_value methods | Select single value by row and column label.|

**Sorting**

We can sort items by doing the following.

In [23]:
dt = pd.Series(np.random.randint(3, 10, size=7), 
               index=['g','c','a','b','e','d','f'])
print('Original Data: \n', dt, end="\n\n")
print('Sorted by Index: \n',dt.sort_index())

Original Data:
 g    4
c    7
a    6
b    7
e    8
d    3
f    9
dtype: int64

Sorted by Index:
 a    6
b    7
c    7
d    3
e    8
f    9
g    4
dtype: int64

### 2.4 Data alignment and arithmetic

Data alignment between DataFrame objects automatically align on both the columns and the index (row labels). The resulting object will have the union of the column and row labels.

In [24]:
df1 = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

print('df1:')
display(df1)
print('df2:')
display(df2)
print('Sum:')
display(df1.add(df2))

df1:

          A         B         C         D
0 -0.075197  1.071788 -0.346722  0.200615
1  1.344002 -0.245280 -1.422829  0.108585
2  0.536841  0.015907 -0.734943  0.749065
3  0.988480  0.489212 -1.426875  0.164377
4 -0.468510 -0.979854  0.293018  0.944181
5  0.043697 -0.211873 -1.554627 -0.015371
6  0.585974  1.262029  0.403454 -0.657079
7  0.309760 -0.230141  1.626267  1.151040
8 -0.869131  0.738002  1.211384  2.257951
9  1.034295 -1.547727  1.515287  0.304565

df2:

          A         B         C
0 -1.151598 -1.719839 -1.444585
1  1.252279  0.069754 -1.196836
2  1.378880  0.461332  0.059675
3 -0.824091 -0.427750  0.985102
4 -1.368444 -0.342445 -0.537114
5  1.091544 -0.065743 -0.066165
6  1.031548 -0.109830 -0.370547

Sum:

          A         B         C   D
0 -1.226796 -0.648051 -1.791307 NaN
1  2.596282 -0.175525 -2.619664 NaN
2  1.915721  0.477239 -0.675268 NaN
3  0.164389  0.061461 -0.441773 NaN
4 -1.836953 -1.322298 -0.244097 NaN
5  1.135241 -0.277616 -1.620792 NaN
6  1.617523  1.152200  0.032908 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

Note that in arithmetic operations between differently-indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other:

In [25]:
df1.add(df2, fill_value=0)

          A         B         C         D
0 -1.226796 -0.648051 -1.791307  0.200615
1  2.596282 -0.175525 -2.619664  0.108585
2  1.915721  0.477239 -0.675268  0.749065
3  0.164389  0.061461 -0.441773  0.164377
4 -1.836953 -1.322298 -0.244097  0.944181
5  1.135241 -0.277616 -1.620792 -0.015371
6  1.617523  1.152200  0.032908 -0.657079
7  0.309760 -0.230141  1.626267  1.151040
8 -0.869131  0.738002  1.211384  2.257951
9  1.034295 -1.547727  1.515287  0.304565

Similarly, you can perform other arithmetic operations such as subtracion, multiplication and division.

When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns, thus broadcasting (just like in numpy) row-wise.

In [26]:
print("Dataframe:")
display(df1)
print("Operand (0th row):")
display(df1.loc[0])
print('Subtraction:')
display(df1.sub(df1.loc[0]))

Dataframe:

          A         B         C         D
0 -0.075197  1.071788 -0.346722  0.200615
1  1.344002 -0.245280 -1.422829  0.108585
2  0.536841  0.015907 -0.734943  0.749065
3  0.988480  0.489212 -1.426875  0.164377
4 -0.468510 -0.979854  0.293018  0.944181
5  0.043697 -0.211873 -1.554627 -0.015371
6  0.585974  1.262029  0.403454 -0.657079
7  0.309760 -0.230141  1.626267  1.151040
8 -0.869131  0.738002  1.211384  2.257951
9  1.034295 -1.547727  1.515287  0.304565

Operand (0th row):

A   -0.075197
B    1.071788
C   -0.346722
D    0.200615
Name: 0, dtype: float64

Subtraction:

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  1.419199 -1.317067 -1.076107 -0.092030
2  0.612038 -1.055881 -0.388221  0.548449
3  1.063678 -0.582576 -1.080153 -0.036238
4 -0.393312 -2.051642  0.639739  0.743566
5  0.118894 -1.283661 -1.207905 -0.215986
6  0.661172  0.190242  0.750176 -0.857694
7  0.384958 -1.301929  1.972988  0.950425
8 -0.793934 -0.333786  1.558105  2.057335
9  1.109492 -2.619515  1.862009  0.103950

In the special case of working with time series data, and the DataFrame index also contains dates, the broadcasting will be column-wise:

In [27]:
ind1 = pd.date_range('06/1/2017', periods=10)
df1.set_index(ind1)

                   A         B         C         D
2017-06-01 -0.075197  1.071788 -0.346722  0.200615
2017-06-02  1.344002 -0.245280 -1.422829  0.108585
2017-06-03  0.536841  0.015907 -0.734943  0.749065
2017-06-04  0.988480  0.489212 -1.426875  0.164377
2017-06-05 -0.468510 -0.979854  0.293018  0.944181
2017-06-06  0.043697 -0.211873 -1.554627 -0.015371
2017-06-07  0.585974  1.262029  0.403454 -0.657079
2017-06-08  0.309760 -0.230141  1.626267  1.151040
2017-06-09 -0.869131  0.738002  1.211384  2.257951
2017-06-10  1.034295 -1.547727  1.515287  0.304565

### 2.5 Using Numpy functions on DataFrame

Element-wise numpy functions like log, exp, sqrt, ... and various other numpy functions can be used on DataFrame.

In [28]:
np.abs(df1)

          A         B         C         D
0  0.075197  1.071788  0.346722  0.200615
1  1.344002  0.245280  1.422829  0.108585
2  0.536841  0.015907  0.734943  0.749065
3  0.988480  0.489212  1.426875  0.164377
4  0.468510  0.979854  0.293018  0.944181
5  0.043697  0.211873  1.554627  0.015371
6  0.585974  1.262029  0.403454  0.657079
7  0.309760  0.230141  1.626267  1.151040
8  0.869131  0.738002  1.211384  2.257951
9  1.034295  1.547727  1.515287  0.304565

In [29]:
# Convert to numpy array
np.asarray(df1)

array([[-0.07519733,  1.07178771, -0.34672175,  0.2006154 ],
       [ 1.34400207, -0.24527969, -1.42282892,  0.10858524],
       [ 0.53684115,  0.01590705, -0.73494288,  0.74906479],
       [ 0.98848038,  0.48921191, -1.42687493,  0.16437737],
       [-0.46850962, -0.97985388,  0.29301751,  0.94418121],
       [ 0.04369676, -0.21187287, -1.55462703, -0.01537086],
       [ 0.58597426,  1.26202949,  0.40345448, -0.65707878],
       [ 0.30976042, -0.23014127,  1.62626658,  1.15104   ],
       [-0.86913143,  0.73800196,  1.21138375,  2.25795057],
       [ 1.03429485, -1.54772712,  1.51528723,  0.30456533]])

Sometimes, we have to apply a custom logic when transforming our DataFrame. We can use `apply` function for this. It allows us to apply a function on 1D arrays to each column or row.

In [30]:
def fn(x):
    """
    Get max and min of the columns
    """
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

df1.apply(fn)

            A         B         C         D
min -0.869131 -1.547727 -1.554627 -0.657079
max  1.344002  1.262029  1.626267  2.257951

Element-wise mapping can be done too.

In [31]:
fmt = lambda x: "{:.3f}".format(x)
df1.applymap(fmt)

        A       B       C       D
0  -0.075   1.072  -0.347   0.201
1   1.344  -0.245  -1.423   0.109
2   0.537   0.016  -0.735   0.749
3   0.988   0.489  -1.427   0.164
4  -0.469  -0.980   0.293   0.944
5   0.044  -0.212  -1.555  -0.015
6   0.586   1.262   0.403  -0.657
7   0.310  -0.230   1.626   1.151
8  -0.869   0.738   1.211   2.258
9   1.034  -1.548   1.515   0.305

## 3. Exploratory Data Analysis using Pandas

In this section, we'll demonstrate how Pandas is used for analyzing real-world datasets.

**Loading data**

The first thing that we have to do is acquire the data and load it into our system. For the following examples, we will use the very popular Titanic dataset. We can load the data by using one of the following commands in Pandas.

|Function| Description|
|:---|:---|
|read_csv | Load delimited data from a file, URL, or file-like object. Use comma as default delimiter|
|read_table | Load delimited data from a file, URL, or file-like object. Use tab ('\\t') as default delimiter|
|read_fwf | Read data in fixed-width column format (that is, no delimiters)|
|read_clipboard | Version of read_table that reads data from the clipboard. Useful for converting tables from web pages.|

`train.csv` in our 'data' folder contains the "train set" of the titanic dataset. We'll explore what "train set" means in future sessions (or you could read up on your own), but what's important to know is this is simply a subset of the original dataset. We'll be loading this file for the following examples. We will be using `read_csv` here since our dataset is in csv format.

In [32]:
df = pd.read_csv('data/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Notice that we have appended `train.csv` to data. What happens here is in your current directory, you go inside 'data' folder and then access the `train.csv` file. 

We used the `head` method to just display the first 5 (default) entries.

> To know more about what the column names mean, see this link: https://www.kaggle.com/c/titanic/data

Let's check the dimensions and data types in our dataset.

In [33]:
df.shape

(891, 12)

In [34]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object


We can use the following snippet to check the number of null values in our dataset.

In [35]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

As we can see, there are null values in `Age`, `Cabin` and `Embarked` columns.

What if we want to get the age?

In [36]:
df['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

We can get the average age. Note that we can use this method for numeric data types. The different types of data (in general, not Python) will be further explained in future modules.

In [37]:
df['Age'].mean()

29.69911764705882

What about categorical data types?

In [38]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

We can also filter the dataset to only those who survived.

In [39]:
df_survived = df[df.Survived==1]
df_survived.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [40]:
df_survived['Age'].mean()

28.343689655172415

In [41]:
df_survived['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64